// events.js
// 定義過往紀念日和未來紀念日
const events = [
    {
        title: "100天紀念日",
        date: "2026-01-12",
        type: "past",   // 過去的紀念日
        text: "To my girl:  亲爱的老婆~~今天是我们在一起的100天了啊没有想到时间过到将快一下子就到100天了 今天是最特别也是最有纪念意义的日子很开心我们可以一起走到这一天虽然相处的这段时间里我们偶尔会吵架但是每次我们都可以一起共同面对那些问题一起消化情绪 我知道我算不上一个很好的男朋友但是我会为了你改变一切直到我们可以包容彼此最后我想对你讲谢谢将久以来你对我的耐心还有信任我真的很开心可以跟你在一起将久在这段日子里你不只带给我很大的情绪价值也让我成长了很多已经不再是那个不懂事的小孩子了虽然我现在给不了你什么但是如果可以的话我希望你会一直等我直到以后我有能力了 我会亲手牵着你走进婚姻的殿堂给你一个幸福的家也希望我们可以一直走下去永远都不分开在一起99"
    },
    {
        title: "情人節",
        date: "2026-02-14",
        type: "future"  // 未來紀念日
    },
    {
        title: "520紀念日",
        date: "2026-05-20",
        type: "future"
    }
];
